Revit 2024 API
ExporterIFCUtils.CreateAlternateGUID Method
 Creates a GUID for the given element.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static string CreateAlternateGUID(
	Element pElement
)
Visual Basic
Public Shared Function CreateAlternateGUID ( _
	pElement As Element _
) As String
Visual C++
public:
static String^ CreateAlternateGUID(
	Element^ pElement
)
Parameters
pElement
Type: Autodesk.Revit.DB.Element
 The element.
Return Value
 The guid string.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace